kutays/esp-idf-threadx/sdkconfig.defaults
# ESP32-C6 target
CONFIG_IDF_TARGET="esp32c6"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Disable watchdogs for initial debugging
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_INT_WDT=n

# UART console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Disable FreeRTOS idle task watchdog
CONFIG_FREERTOS_HZ=100

# RTOS selection — ThreadX by default for this project
CONFIG_RTOS_SELECTION_THREADX=y

# ThreadX compat layer needs larger struct __lock (txfr_sem_t > 84 bytes)
CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES=y
